Revit 2027 API
ParameterTypeId.CurveIsSlopeDefining Property
 "Defines Slope"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CurveIsSlopeDefining { get; }
Public Shared ReadOnly Property CurveIsSlopeDefining As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CurveIsSlopeDefining {
	ForgeTypeId^ get ();
}
static member CurveIsSlopeDefining : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace